modules/samples/oauth/oauth10a-resource-owner-equivalent/src/main/resources/synapse.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
 ~ Copyright (c) 2005-2011, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
 ~
 ~ WSO2 Inc. licenses this file to you under the Apache License,
 ~ Version 2.0 (the "License"); you may not use this file except
 ~ in compliance with the License.
 ~ You may obtain a copy of the License at
 ~
 ~    http://www.apache.org/licenses/LICENSE-2.0
 ~
 ~ Unless required by applicable law or agreed to in writing,
 ~ software distributed under the License is distributed on an
 ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 ~ KIND, either express or implied.  See the License for the
 ~ specific language governing permissions and limitations
 ~ under the License.
 -->

<definitions xmlns="http://ws.apache.org/ns/synapse">
    <registry provider="org.wso2.carbon.mediation.registry.WSO2Registry"/>
    <proxy name="OAuthProxy" transports="https http" startOnLoad="true" trace="disable">
        <target>
            <inSequence>
                <oauthService remoteServiceUrl="https://localhost:9443/services/"/>
                <send>
                    <endpoint name="endpoint_urn_uuid_720A5B12D7E7AB32D812343386071998-1622019665">
                        <address uri="http://localhost:8280/services/echo" format="rest"/>
                    </endpoint>
                </send>
            </inSequence>
            <outSequence>
                <send/>
            </outSequence>
        </target>
        <publishWSDL>
            <wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:ns="http://echo.services.core.carbon.wso2.org" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:ax21="http://echo.services.core.carbon.wso2.org/xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://echo.services.core.carbon.wso2.org">
                <wsdl:documentation>echo</wsdl:documentation>
                <wsdl:types>
                    <xs:schema attributeFormDefault="qualified" elementFormDefault="unqualified" targetNamespace="http://echo.services.core.carbon.wso2.org/xsd">
                        <xs:complexType name="SimpleBean">
                            <xs:sequence>
                                <xs:element maxOccurs="unbounded" name="a_r" nillable="true" type="xs:string"/>
                                <xs:element maxOccurs="unbounded" name="b_r" nillable="true" type="xs:string"/>
                                <xs:element name="c" type="xs:int"/>
                            </xs:sequence>
                        </xs:complexType>
                    </xs:schema>
                    <xs:schema xmlns:ax22="http://echo.services.core.carbon.wso2.org/xsd" attributeFormDefault="qualified" elementFormDefault="unqualified" targetNamespace="http://echo.services.core.carbon.wso2.org">
                        <xs:import namespace="http://echo.services.core.carbon.wso2.org/xsd"/>
                        <xs:complexType name="Exception">
                            <xs:sequence>
                                <xs:element name="Exception" nillable="true" type="xs:anyType"/>
                            </xs:sequence>
                        </xs:complexType>
                        <xs:element name="throwAxisFaultResponse">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="return" nillable="true" type="xs:string"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoStringArrays">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element maxOccurs="unbounded" name="a" nillable="true" type="xs:string"/>
                                    <xs:element maxOccurs="unbounded" name="b" nillable="true" type="xs:string"/>
                                    <xs:element name="c" type="xs:int"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoStringArraysResponse">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="return" nillable="true" type="ax22:SimpleBean"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoString">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="in" nillable="true" type="xs:string"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoStringResponse">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="return" nillable="true" type="xs:string"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoOMElement">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="omEle" nillable="true" type="xs:anyType"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoOMElementResponse">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="return" nillable="true" type="xs:anyType"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoInt">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="in" type="xs:int"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                        <xs:element name="echoIntResponse">
                            <xs:complexType>
                                <xs:sequence>
                                    <xs:element name="return" type="xs:int"/>
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                    </xs:schema>
                </wsdl:types>
                <wsdl:message name="echoStringArraysRequest">
                    <wsdl:part name="parameters" element="ns:echoStringArrays"/>
                </wsdl:message>
                <wsdl:message name="echoStringArraysResponse">
                    <wsdl:part name="parameters" element="ns:echoStringArraysResponse"/>
                </wsdl:message>
                <wsdl:message name="echoOMElementRequest">
                    <wsdl:part name="parameters" element="ns:echoOMElement"/>
                </wsdl:message>
                <wsdl:message name="echoOMElementResponse">
                    <wsdl:part name="parameters" element="ns:echoOMElementResponse"/>
                </wsdl:message>
                <wsdl:message name="echoIntRequest">
                    <wsdl:part name="parameters" element="ns:echoInt"/>
                </wsdl:message>
                <wsdl:message name="echoIntResponse">
                    <wsdl:part name="parameters" element="ns:echoIntResponse"/>
                </wsdl:message>
                <wsdl:message name="throwAxisFaultRequest"/>
                <wsdl:message name="throwAxisFaultResponse">
                    <wsdl:part name="parameters" element="ns:throwAxisFaultResponse"/>
                </wsdl:message>
                <wsdl:message name="echoStringRequest">
                    <wsdl:part name="parameters" element="ns:echoString"/>
                </wsdl:message>
                <wsdl:message name="echoStringResponse">
                    <wsdl:part name="parameters" element="ns:echoStringResponse"/>
                </wsdl:message>
                <wsdl:portType name="echoPortType">
                    <wsdl:operation name="echoStringArrays">
                        <wsdl:input message="ns:echoStringArraysRequest" wsaw:Action="urn:echoStringArrays"/>
                        <wsdl:output message="ns:echoStringArraysResponse" wsaw:Action="urn:echoStringArraysResponse"/>
                    </wsdl:operation>
                    <wsdl:operation name="echoOMElement">
                        <wsdl:input message="ns:echoOMElementRequest" wsaw:Action="urn:echoOMElement"/>
                        <wsdl:output message="ns:echoOMElementResponse" wsaw:Action="urn:echoOMElementResponse"/>
                    </wsdl:operation>
                    <wsdl:operation name="echoInt">
                        <wsdl:input message="ns:echoIntRequest" wsaw:Action="urn:echoInt"/>
                        <wsdl:output message="ns:echoIntResponse" wsaw:Action="urn:echoIntResponse"/>
                    </wsdl:operation>
                    <wsdl:operation name="throwAxisFault">
                        <wsdl:input message="ns:throwAxisFaultRequest" wsaw:Action="urn:throwAxisFault"/>
                        <wsdl:output message="ns:throwAxisFaultResponse" wsaw:Action="urn:throwAxisFaultResponse"/>
                    </wsdl:operation>
                    <wsdl:operation name="echoString">
                        <wsdl:input message="ns:echoStringRequest" wsaw:Action="urn:echoString"/>
                        <wsdl:output message="ns:echoStringResponse" wsaw:Action="urn:echoStringResponse"/>
                    </wsdl:operation>
                </wsdl:portType>
                <wsdl:binding name="echoSoap11Binding" type="ns:echoPortType">
                    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
                    <wsdl:operation name="echoStringArrays">
                        <soap:operation soapAction="urn:echoStringArrays" style="document"/>
                        <wsdl:input>
                            <soap:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoOMElement">
                        <soap:operation soapAction="urn:echoOMElement" style="document"/>
                        <wsdl:input>
                            <soap:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoInt">
                        <soap:operation soapAction="urn:echoInt" style="document"/>
                        <wsdl:input>
                            <soap:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="throwAxisFault">
                        <soap:operation soapAction="urn:throwAxisFault" style="document"/>
                        <wsdl:input>
                            <soap:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoString">
                        <soap:operation soapAction="urn:echoString" style="document"/>
                        <wsdl:input>
                            <soap:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                </wsdl:binding>
                <wsdl:binding name="echoSoap12Binding" type="ns:echoPortType">
                    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
                    <wsdl:operation name="echoStringArrays">
                        <soap12:operation soapAction="urn:echoStringArrays" style="document"/>
                        <wsdl:input>
                            <soap12:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap12:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoOMElement">
                        <soap12:operation soapAction="urn:echoOMElement" style="document"/>
                        <wsdl:input>
                            <soap12:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap12:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoInt">
                        <soap12:operation soapAction="urn:echoInt" style="document"/>
                        <wsdl:input>
                            <soap12:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap12:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="throwAxisFault">
                        <soap12:operation soapAction="urn:throwAxisFault" style="document"/>
                        <wsdl:input>
                            <soap12:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap12:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoString">
                        <soap12:operation soapAction="urn:echoString" style="document"/>
                        <wsdl:input>
                            <soap12:body use="literal"/>
                        </wsdl:input>
                        <wsdl:output>
                            <soap12:body use="literal"/>
                        </wsdl:output>
                    </wsdl:operation>
                </wsdl:binding>
                <wsdl:binding name="echoHttpBinding" type="ns:echoPortType">
                    <http:binding verb="POST"/>
                    <wsdl:operation name="echoStringArrays">
                        <http:operation location="echoStringArrays"/>
                        <wsdl:input>
                            <mime:content type="text/xml" part="echoStringArrays"/>
                        </wsdl:input>
                        <wsdl:output>
                            <mime:content type="text/xml" part="echoStringArrays"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoOMElement">
                        <http:operation location="echoOMElement"/>
                        <wsdl:input>
                            <mime:content type="text/xml" part="echoOMElement"/>
                        </wsdl:input>
                        <wsdl:output>
                            <mime:content type="text/xml" part="echoOMElement"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoInt">
                        <http:operation location="echoInt"/>
                        <wsdl:input>
                            <mime:content type="text/xml" part="echoInt"/>
                        </wsdl:input>
                        <wsdl:output>
                            <mime:content type="text/xml" part="echoInt"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="throwAxisFault">
                        <http:operation location="throwAxisFault"/>
                        <wsdl:input>
                            <mime:content type="text/xml" part="throwAxisFault"/>
                        </wsdl:input>
                        <wsdl:output>
                            <mime:content type="text/xml" part="throwAxisFault"/>
                        </wsdl:output>
                    </wsdl:operation>
                    <wsdl:operation name="echoString">
                        <http:operation location="echoString"/>
                        <wsdl:input>
                            <mime:content type="text/xml" part="echoString"/>
                        </wsdl:input>
                        <wsdl:output>
                            <mime:content type="text/xml" part="echoString"/>
                        </wsdl:output>
                    </wsdl:operation>
                </wsdl:binding>
                <wsdl:service name="echo">
                    <wsdl:port name="echoHttpsSoap11Endpoint" binding="ns:echoSoap11Binding">
                        <soap:address location="https://localhost:8243/services/echo.echoHttpsSoap11Endpoint"/>
                    </wsdl:port>
                    <wsdl:port name="echoHttpSoap11Endpoint" binding="ns:echoSoap11Binding">
                        <soap:address location="http://localhost:8280/services/echo.echoHttpSoap11Endpoint"/>
                    </wsdl:port>
                    <wsdl:port name="echoHttpSoap12Endpoint" binding="ns:echoSoap12Binding">
                        <soap12:address location="http://localhost:8280/services/echo.echoHttpSoap12Endpoint"/>
                    </wsdl:port>
                    <wsdl:port name="echoHttpsSoap12Endpoint" binding="ns:echoSoap12Binding">
                        <soap12:address location="https://localhost:8243/services/echo.echoHttpsSoap12Endpoint"/>
                    </wsdl:port>
                    <wsdl:port name="echoHttpEndpoint" binding="ns:echoHttpBinding">
                        <http:address location="http://localhost:8280/services/echo.echoHttpEndpoint"/>
                    </wsdl:port>
                    <wsdl:port name="echoHttpsEndpoint" binding="ns:echoHttpBinding">
                        <http:address location="https://localhost:8243/services/echo.echoHttpsEndpoint"/>
                    </wsdl:port>
                </wsdl:service>
            </wsdl:definitions>
        </publishWSDL>
        <parameter name="enablePublishWSDLSafeMode">true</parameter>
    </proxy>
    <sequence name="fault">
        <log level="full">
            <property name="MESSAGE" value="Executing default 'fault' sequence"/>
            <property name="ERROR_CODE" expression="get-property('ERROR_CODE')"/>
            <property name="ERROR_MESSAGE" expression="get-property('ERROR_MESSAGE')"/>
        </log>
        <drop/>
    </sequence>
    <sequence name="main">
        <in>
            <log level="full"/>
            <filter source="get-property('To')" regex="http://localhost:9000.*">
                <send/>
            </filter>
        </in>
        <out>
            <send/>
        </out>
    </sequence>
</definitions>
