.metadata/.plugins/org.eclipse.core.resources/.history/6/504e8425646f00171a18e890cc9fdf5f

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="reciveSeq" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log description="incoming responce logging" level="full">
        <property name="message" value="incoming Request to PayLoad###"/>
    </log>
    <payloadFactory description="addSoapBody" media-type="xml">
        <format>
            <soapenv:Envelope xmlns:echo="http://echo.services.core.carbon.wso2.org" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                <soapenv:Header/>
                <soapenv:Body>
                    <echo:echoString>
                        <!--Optional:-->
                        <in>$1</in>
                    </echo:echoString>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args/>
    </payloadFactory>
    <log level="full"/>
    <send description=" passing the responce to the Echo service">
        <endpoint>
            <address uri="http://10.100.1.11:9764/services/echo/"/>
        </endpoint>
    </send>
</sequence>
