Scenario5/src/main/synapse-config/sequences/ReceiveSequence.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="ReceiveSequence" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log description="Receive Log">
        <property name="property_name" value="################Receive Log##############3"/>
    </log>
    <property name="SOAPAction" scope="transport" type="STRING" value=""/>
    <payloadFactory media-type="xml">
        <format>
            <soapenv:Envelope xmlns:ser="http://services.samples" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://services.samples/xsd">
                <soapenv:Header name="Action" value=""/>
                <soapenv:Body>
                    <p:echoString xmlns:p="http://echo.services.core.carbon.wso2.org">
                        <!--0 to 1 occurrence-->
                        <in>$1</in>
                    </p:echoString>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="//ax2431:name" xmlns:ax2431="http://services.samples/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <arg evaluator="xml" expression="/soapenv:Envelope/soapenv:Body/ns:getQuoteResponse/ns:return/*[8]/text()" xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope/"/>
        </args>
    </payloadFactory>
    <log description="PayLoadFactoryPass">
        <property name="property_name" value="PayLoadFactory Passing"/>
    </log>
    <log description="AfterPayLoad" level="full">
        <property name="property_name" value="##################After Log###########3"/>
    </log>
    <send receive="EchoBackSequence">
        <endpoint>
            <address uri="http://10.100.7.80:9765/services/echo/"/>
        </endpoint>
    </send>
</sequence>
